ERP DEV.WMS/src/InformationRegisters/вмс_СоединениеОбъектов/вмс_СоединениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СоединениеОбъектов</name>
  <resources>
    <name>ОсновнойРесурс</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИсточник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПриемник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Схема</name>
    <type>
      <types>CatalogRef.вмс_СхемыСоединенияОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение3</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_МестоположенияКонтейнеров/вмс_МестоположенияКонтейнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_МестоположенияКонтейнеров</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КонтейнерРодитель</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </resources>
  <resources>
    <name>КонтейнерОстатковВЯчейках</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </resources>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/вмс_ВидыКонтейнеров/вмс_ВидыКонтейнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ВидыКонтейнеров</name>
  <enumValues>
    <name>Паллета</name>
  </enumValues>
  <enumValues>
    <name>Короб</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/CommonModules/вмс_ПартионныйУчетСервер/Module.bsl
// ВНИМАНИЕ
// Модуль только перенаправляет функции в обработку вмс_ЗащищенныйМодуль в одноименный с названием модуля раздел
// Функции с другими действиями не должны добавляться сюда 

// СУС	- Система управления складом
// ОХ	- Ответственное хранение

#Область API

// СУС-ОХ:
Функция ПолучитьСоставПартии(МассивКонтейнеров,ПолнаяРазузловка = Истина,Товары = Истина,Партии = Истина) Экспорт
	Параметры = Новый Структура("МассивКонтейнеров,ПолнаяРазузловка,Товары,Партии", МассивКонтейнеров,ПолнаяРазузловка,Товары,Партии); 
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьСоставПартии", Параметры);
КонецФункции

// СУС: Плугина
Функция ПолучитьВсеТоварыКонтейнеров(Контейнеры, ДополнительныеПараметры=Неопределено) Экспорт
	Параметры = Новый Структура("Контейнеры, ДополнительныеПараметры", Контейнеры, ДополнительныеПараметры);
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьВсеТоварыКонтейнеров", Параметры);
КонецФункции

// СУС:
Функция ПолучитьВидыПартийДляВидовТоваров(ВидыТоваров)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СоединениеОбъектов.ОбъектПриемник КАК ВидТовара,
	|	вмс_СоединениеОбъектов.ОбъектИсточник КАК ВидПартии
	|ИЗ
	|	РегистрСведений.вмс_СоединениеОбъектов КАК вмс_СоединениеОбъектов
	|ГДЕ
	|	вмс_СоединениеОбъектов.ОбъектПриемник В(&ВидыТоваров)
	|	И вмс_СоединениеОбъектов.ОбъектИсточник ССЫЛКА Справочник.вмс_ВидыПартийТоваров
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	вмс_СоединениеОбъектов.ОбъектИсточник,
	|	вмс_СоединениеОбъектов.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.вмс_СоединениеОбъектов КАК вмс_СоединениеОбъектов
	|ГДЕ
	|	вмс_СоединениеОбъектов.ОбъектИсточник В(&ВидыТоваров)
	|	И вмс_СоединениеОбъектов.ОбъектПриемник ССЫЛКА Справочник.вмс_ВидыПартийТоваров";
	Запрос.УстановитьПараметр("ВидыТоваров", ВидыТоваров);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидыПартийДляВидовТоваров = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаВидыПартийДляВидовТоваров;

КонецФункции

// СУС:
Функция ПолучитьВидыПартийДляТоваров(Товары) Экспорт
	
	ТаблицаВидыТоваров = вмс_ОбщегоНазначенияСервер.ПолучитьВидыТоваров(Товары);
	ТаблицаПартииТоваров = ТаблицаВидыТоваров.Скопировать();
	ТаблицаВидыТоваров.Свернуть("ВидТовара");
	ВидыТоваров = ТаблицаВидыТоваров.ВыгрузитьКолонку("ВидТовара"); 
	// ТУ_Мовчан 01.06.23 ++
	Для каждого Строка Из Товары Цикл
	   ВидыТоваров.Добавить(Строка); 
	КонецЦикла;
	// ТУ_Мовчан 01.06.23 --
	
	ТаблицаВидыПартийДляВидовТоваров = ПолучитьВидыПартийДляВидовТоваров(ВидыТоваров);
	
	СтрокиТовараУдалить = Новый Массив;
	ТаблицаПартииТоваров.Колонки.Добавить("ВидПартии");
	Для Каждого СтрокаТовара Из ТаблицаПартииТоваров Цикл
		НайденныеСтрокиВидыПартий = ТаблицаВидыПартийДляВидовТоваров.НайтиСтроки(Новый Структура("ВидТовара", СтрокаТовара.ВидТовара));
		Если НайденныеСтрокиВидыПартий.Количество() > 0 Тогда
			СтрокаТовара.ВидПартии = НайденныеСтрокиВидыПартий[0].ВидПартии;
		Иначе
			// ТУ_Мовчан 01.06.23 ++
			НайденныеСтрокиВидыПартий = ТаблицаВидыПартийДляВидовТоваров.НайтиСтроки(Новый Структура("ВидТовара", СтрокаТовара.Товар));
			Если НайденныеСтрокиВидыПартий.Количество() > 0 Тогда
				СтрокаТовара.ВидПартии = НайденныеСтрокиВидыПартий[0].ВидПартии;
			Иначе
				СтрокиТовараУдалить.Добавить(СтрокаТовара);
			КонецЕсли; 
			// ТУ_Мовчан 01.06.23 -- 
			
			//СтрокиТовараУдалить.Добавить(СтрокаТовара);
		КонецЕсли;
	КонецЦикла;
	
	вмс_РаботаСКоллекциями.УдалитьЭлементыКоллекции(ТаблицаПартииТоваров, СтрокиТовараУдалить);
	
	Возврат ТаблицаПартииТоваров;   
	
КонецФункции

// СУС:
Функция ПолучитьВидПартииДляМоноТовара(Товар)

	ТаблицаПартииТоваров = ПолучитьВидыПартийДляТоваров(Товар);
	Если ТаблицаПартииТоваров.Количество() > 0 Тогда
		Возврат ТаблицаПартииТоваров[0].ВидПартии;
	КонецЕсли;
	
КонецФункции

// СУС-ОХ:
Функция ПолучитьТаблицуСоставаПоКонтейнерам(Контейнеры, ДополнительныеПараметры=Неопределено) Экспорт
	Параметры = Новый Структура("Контейнеры, ДополнительныеПараметры", Контейнеры, ДополнительныеПараметры);
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьТаблицуСоставаПоКонтейнерам", Параметры);
КонецФункции

// СУС:
Функция ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам(Контейнеры, Вниз=Истина, ДополнительныеПараметры=Неопределено) Экспорт
	Параметры = Новый Структура("Контейнеры, Вниз, ДополнительныеПараметры", Контейнеры, Вниз, ДополнительныеПараметры);
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам", Параметры);
КонецФункции

// СУС:
Функция СоставКонтейнераУпрощенный(Контейнер) Экспорт
	Параметры = Новый Структура("Контейнеры", Контейнер);
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("СоставКонтейнераУпрощенный", Параметры);
КонецФункции

// СУС:
Функция ПолучитьДанныеДляОтгрузкиСПроверкой(ДокументОснование, ОперацияПлан, ОперацияОтгрузки) Экспорт     
	
	РК = вмс_РаботаСКоллекциями;	
	ВыходнаяСтруктура = Новый Структура;	
	ПараметрыОтбора = Новый Структура("ДокументОснование, ВидОперации, ВключаяДокументыОпераций", ДокументОснование, ОперацияПлан, Неопределено);
	
	ТаблицаОтобраных = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(ПараметрыОтбора);     
	
	ПолеКонтейнера = "Контейнер";
	ТаблицаКонтейнеров = ТаблицаОтобраных.Скопировать(, "Контейнер, ЯчейкаПриемник");
	ЗонаОтгрузки = Неопределено;
	Для Каждого Строка Из ТаблицаКонтейнеров Цикл
		Если ЗначениеЗаполнено(Строка.ЯчейкаПриемник) Тогда  
			ЗонаОтгрузки = Строка.ЯчейкаПриемник;
			Прервать;
		КонецЕсли;	
	КонецЦикла;  
	
	ВыходнаяСтруктура.Вставить("ЗонаОтгрузки", ЗонаОтгрузки);
		
	ТаблицаКонтейнеров.Свернуть(ПолеКонтейнера);
	КонтейнерыПоПлану = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаКонтейнеров, ПолеКонтейнера);    
	РК.УдалитьПустыеСтрокиКоллекции(КонтейнерыПоПлану);
	
	ВыходнаяСтруктура.Вставить("ВходнойМассивКонтейнеров", КонтейнерыПоПлану);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вмс_ОперацияПоЯчейкамТовары.Контейнер КАК Контейнер
		|ИЗ
		|	Документ.вмс_ОперацияПоЯчейкам.Товары КАК вмс_ОперацияПоЯчейкамТовары
		|ГДЕ
		|	вмс_ОперацияПоЯчейкамТовары.Ссылка.ВидОперации = &ВидОперацииОтгрузки
		|	И вмс_ОперацияПоЯчейкамТовары.Ссылка.Проведен
		|	И вмс_ОперацияПоЯчейкамТовары.Ссылка.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ВидОперацииОтгрузки", ОперацияОтгрузки);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	ТаблицаВыполненныхКонтейнеров = Запрос.Выполнить().Выгрузить();
	
	ВыполненныеКонтейнеры = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаВыполненныхКонтейнеров, ПолеКонтейнера);
	РК.УдалитьПустыеСтрокиКоллекции(ВыполненныеКонтейнеры);

	
	ВыходнаяСтруктура.Вставить("ВыполненныеКонтейнеры", ВыполненныеКонтейнеры);
	
	Возврат ВыходнаяСтруктура;
		
КонецФункции

//3.2.4
Функция ПолучитьКонтейнерРодитель(Контейнер) Экспорт
	
	ТаблицаМестоположенийКонтейнера = ПолучитьМестоположенияКонтейнеров(Контейнер);
	
	Если ТаблицаМестоположенийКонтейнера.Количество() > 0 Тогда
		Возврат ТаблицаМестоположенийКонтейнера[0].КонтейнерРодитель;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМестоположенияКонтейнеров(Контейнеры, ДополнительныеПараметры=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестоположенияКонтейнеровСрезПоследних.Контейнер КАК Контейнер,
	|	вмс_МестоположенияКонтейнеровСрезПоследних.КонтейнерРодитель КАК КонтейнерРодитель,
	|	вмс_МестоположенияКонтейнеровСрезПоследних.КонтейнерОстатковВЯчейках КАК КонтейнерОстатковВЯчейках,
	|	вмс_МестоположенияКонтейнеровСрезПоследних.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.вмс_МестоположенияКонтейнеров.СрезПоследних(
	|			&Дата,
	|			Контейнер В (&Контейнеры)
	|				И НЕ Регистратор В (&ИсключитьРегистраторы)) КАК вмс_МестоположенияКонтейнеровСрезПоследних";
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);

	Если ТипЗнч(ДополнительныеПараметры)=Тип("Структура") Тогда
		
		Если ДополнительныеПараметры.Свойство("ИсключитьРегистраторы") Тогда
			ИсключитьРегистраторы = ДополнительныеПараметры.ИсключитьРегистраторы;
		Иначе
			ИсключитьРегистраторы = Новый Массив;
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("Дата") Тогда
			Дата = ДополнительныеПараметры.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = '00010101';
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИсключитьРегистраторы", ИсключитьРегистраторы);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаМестоположенийКонтейнеров = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаМестоположенийКонтейнеров;
	
КонецФункции

//3.2.4
Функция НачальноеЗаполнениеВидовКонтейнеров() Экспорт

	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыКонтейнеров.Ссылка КАК ТипКонтейнера
		|ИЗ
		|	ПланВидовХарактеристик.ТипыКонтейнеров КАК ТипыКонтейнеров";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		пОбъект = Выборка.ТипКонтейнера.ПолучитьОбъект();
		пОбъект.ВидКонтейнера = Перечисления.вмс_ВидыКонтейнеров.Короб;
		пОбъект.ОбменДанными.Загрузка = Истина;
		пОбъект.Записать();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	
КонецФункции

#КонецОбласти 

#Область ПрограммныйИнтерфейс

// ОХ: Определение операций ОХ по контейнерам.
//
// Параметры:
//  МассивКонтейнеров - Массив - контейнеры, для которых требуется определить операции ОХ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица соответствия типов контейнеров и операций ОХ.
//
Функция ПолучитьТаблицуОперацийКонтейнеров(МассивКонтейнеров) Экспорт
	Параметры = Новый Структура("МассивКонтейнеров", МассивКонтейнеров); 
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьТаблицуОперацийКонтейнеров", Параметры);
КонецФункции

Функция ПолучитьИнформациюСоставаКонтейнеров(Контейнеры, ДополнительныеПараметры=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаСоставаПоКонтейнерам = ПолучитьТаблицуСоставаПоКонтейнерам(Контейнеры, ДополнительныеПараметры);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаСоставаПоКонтейнерамСУчетомИерархии = ТаблицаСоставаПоКонтейнерам.Скопировать();
	ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Колонки.Добавить("Расстояние"); // между контейнерами
	ТаблицаСоставаПоКонтейнерамСУчетомИерархии.ЗаполнитьЗначения(0, "Расстояние");
	
	ОтборПоКонтейнеру = Новый Структура("Контейнер");
	
	Для Каждого ЭлементСостава Из ТаблицаСоставаПоКонтейнерамСУчетомИерархии Цикл
		
		ОтборПоКонтейнеру.Контейнер = ЭлементСостава.Товар;
		ЭлементыСоставаПоИерархии = ТаблицаСоставаПоКонтейнерамСУчетомИерархии.НайтиСтроки(ОтборПоКонтейнеру);
		
		Для Каждого ЭлементСоставаПоИерархии Из ЭлементыСоставаПоИерархии Цикл
			
			ЭлементСоставаСУчетомИерархии = ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементСоставаСУчетомИерархии, ЭлементСоставаПоИерархии);
			ЭлементСоставаСУчетомИерархии.Контейнер = ЭлементСостава.Контейнер;
			ЭлементСоставаСУчетомИерархии.Расстояние = ЭлементСостава.Расстояние + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Сортировать("Товар, Расстояние УБЫВ");
	
	ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Колонки.Добавить("ИнвертированноеРасстояние");
	Если ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Количество() > 0 Тогда
		
		МаксРасстояние = Неопределено;
		Контейнер = Неопределено;
		
		Для Каждого ЭлементСостава Из ТаблицаСоставаПоКонтейнерамСУчетомИерархии Цикл
			
			Если Контейнер <> ЭлементСостава.Товар Тогда
				МаксРасстояние = ЭлементСостава.Расстояние;
				Контейнер = ЭлементСостава.Товар;
			КонецЕсли;
			
			ЭлементСостава.ИнвертированноеРасстояние = МаксРасстояние - ЭлементСостава.Расстояние;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаКонтейнеровВерхнегоУровня = РК.НоваяКоллекцияЗначений("Контейнер, КонтейнерВерхнегоУровня");
	
	Для Каждого ЭлементСостава Из ТаблицаСоставаПоКонтейнерамСУчетомИерархии.НайтиСтроки(Новый Структура("ИнвертированноеРасстояние, СодержимоеКонтейнер", 0, Истина)) Цикл
		
		КонтейнерВерхнегоУровня = ТаблицаКонтейнеровВерхнегоУровня.Добавить();
		КонтейнерВерхнегоУровня.Контейнер = ЭлементСостава.Товар;
		КонтейнерВерхнегоУровня.КонтейнерВерхнегоУровня = ЭлементСостава.Контейнер;

	КонецЦикла;
								   
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаКонтейнеров = ТаблицаСоставаПоКонтейнерам.Скопировать(Новый Структура("СодержимоеКонтейнер", Истина));
	ТаблицаКонтейнеровСУчетомИерархии = ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Скопировать(Новый Структура("СодержимоеКонтейнер", Истина));

	ТаблицаТоваровПоКонтейнерам = ТаблицаСоставаПоКонтейнерам.Скопировать(Новый Структура("СодержимоеКонтейнер", Ложь));
	ТаблицаТоваровПоКонтейнерамСУчетомИерархии = ТаблицаСоставаПоКонтейнерамСУчетомИерархии.Скопировать(Новый Структура("СодержимоеКонтейнер", Ложь));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	ИнформацияСоставаКонтейнеров = Новый Структура;
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаСоставаПоКонтейнерам", ТаблицаСоставаПоКонтейнерам);
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаСоставаПоКонтейнерамСУчетомИерархии", ТаблицаСоставаПоКонтейнерамСУчетомИерархии);
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаКонтейнеровСУчетомИерархии", ТаблицаКонтейнеровСУчетомИерархии);
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаТоваровПоКонтейнерам", ТаблицаТоваровПоКонтейнерам);
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаТоваровПоКонтейнерамСУчетомИерархии", ТаблицаТоваровПоКонтейнерамСУчетомИерархии);
	ИнформацияСоставаКонтейнеров.Вставить("ТаблицаКонтейнеровВерхнегоУровня", ТаблицаКонтейнеровВерхнегоУровня);
	
	Возврат ИнформацияСоставаКонтейнеров;
	
КонецФункции

#КонецОбласти
